pip install pandas

In [4]:
pip install numpy

Requirement already satisfied: numpy in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (1.26.2)
Note: you may need to restart the kernel to use updated packages.

In [5]:
pip install matplotlib

Requirement already satisfied: matplotlib in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (3.8.2)
Requirement already satisfied: contourpy>=1.0.1 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from matplotlib) (1.2.1)
Requirement already satisfied: cycler>=0.10 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from matplotlib) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from matplotlib) (1.4.5)
Requirement already satisfied: numpy<2,>=1.21 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from matplotlib) (1.26.2)
Requirement already satisfied: packaging>=20.0 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from matplotlib) (23.2)
Requirement already satisfied: pillow>=8 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from matplotlib) (10.4.0)
Requirement already satisfied: pyparsing>=2.3.1 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from matplotlib) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /system/conda/miniconda3/envs/cloudspace/lib/python3.10/site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
import matplotlib.pyplot as plt

In [7]:
import matplotlib.dates as mdates

In [8]:
import pandas as pd

In [9]:
import numpy as np

In [11]:
df = pd.read_csv("~/yfinance/ohlcv.csv")
df.head

<bound method NDFrame.head of       Unnamed: 0        date      open      high       low     close  \
0              0  2010-06-29    1.2667    1.6667    1.1693    1.5927
1              1  2010-06-30    1.6713    2.0280    1.5533    1.5887
2              2  2010-07-01    1.6627    1.7280    1.3513    1.4640
3              3  2010-07-02    1.4700    1.5500    1.2473    1.2800
4              4  2010-07-06    1.2867    1.3333    1.0553    1.0740
...          ...         ...       ...       ...       ...       ...
2976        2976  2023-04-10  183.5600  185.9000  176.1100  184.4000
2977        2977  2023-04-11  184.5100  189.1900  184.1500  186.6000
2978        2978  2023-04-12  186.2900  191.5900  179.7500  179.9000
2979        2979  2023-04-13  181.2500  186.5000  180.3300  185.9500
2980        2980  2023-04-14  185.3600  186.5700  182.0100  185.0000

           volume
0     277519500.0
1     253039500.0
2     121461000.0
3      75871500.0
4     101664000.0
...           ...
2976  123177931.0
2977  100721415.0
2978  131472591.0
2979   99401779.0
2980   84119837.0

[2981 rows x 7 columns]>

In [12]:
print(df.head(n=10))

   Unnamed: 0        date    open    high     low   close       volume
0           0  2010-06-29  1.2667  1.6667  1.1693  1.5927  277519500.0
1           1  2010-06-30  1.6713  2.0280  1.5533  1.5887  253039500.0
2           2  2010-07-01  1.6627  1.7280  1.3513  1.4640  121461000.0
3           3  2010-07-02  1.4700  1.5500  1.2473  1.2800   75871500.0
4           4  2010-07-06  1.2867  1.3333  1.0553  1.0740  101664000.0
5           5  2010-07-07  1.0933  1.1087  0.9987  1.0533  102645000.0
6           6  2010-07-08  1.0567  1.1793  1.0380  1.1640  114526500.0
7           7  2010-07-09  1.1800  1.1933  1.1033  1.1600   60061500.0
8           8  2010-07-12  1.1533  1.2047  1.1233  1.1413   32487000.0
9           9  2010-07-13  1.1533  1.2427  1.1267  1.2093   39439500.0

In [14]:
ohlcvdf = df[['open', 'close']].head(n=10)
ohlcvdf

     open   close
0  1.2667  1.5927
1  1.6713  1.5887
2  1.6627  1.4640
3  1.4700  1.2800
4  1.2867  1.0740
5  1.0933  1.0533
6  1.0567  1.1640
7  1.1800  1.1600
8  1.1533  1.1413
9  1.1533  1.2093

In [15]:
print(ohlcvdf.describe())

            open      close
count  10.000000  10.000000
mean    1.299400   1.272730
std     0.225822   0.203395
min     1.056700   1.053300
25%     1.153300   1.145975
50%     1.223350   1.186650
75%     1.424175   1.418000
max     1.671300   1.592700

In [16]:
ohlcvdf.sort_values(by='close', ascending=True)

     open   close
5  1.0933  1.0533
4  1.2867  1.0740
8  1.1533  1.1413
7  1.1800  1.1600
6  1.0567  1.1640
9  1.1533  1.2093
3  1.4700  1.2800
2  1.6627  1.4640
1  1.6713  1.5887
0  1.2667  1.5927

In [17]:
ser = pd.Series(df["close"])

In [13]:
print("pandas Series:\n",ser)

pandas Series:
 0         1.5927
1         1.5887
2         1.4640
3         1.2800
4         1.0740
          ...
2976    184.4000
2977    186.6000
2978    179.9000
2979    185.9500
2980    185.0000
Name: close, Length: 2981, dtype: float64

In [14]:
npdata = np.array([[1,2,3], [4,5,6], [7,8,9]])

In [15]:
npdatadf = pd.DataFrame(npdata, columns=['A', 'B', 'C'])

In [16]:
print(npdatadf)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}

In [18]:
dictdf = pd.DataFrame(dict)

In [19]:
print(dictdf)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [20]:
print(ser[16])

1.4

In [21]:
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])

labelSeries = pd.Series(data, index=[10,11,12,13,14,15,16,17,18,19,20,21,22])

In [22]:
print(labelSeries[4:10])

14    s
15    f
16    o
17    r
18    g
19    e
dtype: object

In [23]:
dataser = ser.head(10)

In [24]:
print(dataser)

0    1.5927
1    1.5887
2    1.4640
3    1.2800
4    1.0740
5    1.0533
6    1.1640
7    1.1600
8    1.1413
9    1.2093
Name: close, dtype: float64

In [25]:
dataser.loc[3:10]

3    1.2800
4    1.0740
5    1.0533
6    1.1640
7    1.1600
8    1.1413
9    1.2093
Name: close, dtype: float64

In [26]:
dataser.iloc[3:10]

3    1.2800
4    1.0740
5    1.0533
6    1.1640
7    1.1600
8    1.1413
9    1.2093
Name: close, dtype: float64

In [27]:
ser = ser.astype(float)

In [28]:
print(ser)

0         1.5927
1         1.5887
2         1.4640
3         1.2800
4         1.0740
          ...
2976    184.4000
2977    186.6000
2978    179.9000
2979    185.9500
2980    185.0000
Name: close, Length: 2981, dtype: float64

In [29]:
percentiles = [.20, .40, .60, .80]
include = ['object', 'float', 'int']

desc = df.describe(percentiles=percentiles, include=include)

In [30]:
print(desc)

         Unnamed: 0        date         open         high          low  \
count   2981.000000        2981  2981.000000  2981.000000  2981.000000
unique          NaN        2981          NaN          NaN          NaN
top             NaN  2023-04-14          NaN          NaN          NaN
freq            NaN           1          NaN          NaN          NaN
mean    1490.000000         NaN    65.450428    67.205237    63.561403
std      860.684902         NaN    98.925380   101.580267    95.974997
min        0.000000         NaN     1.056700     1.108700     0.998700
20%      596.000000         NaN     2.567300     2.663300     2.516700
40%     1192.000000         NaN    14.833300    15.110000    14.563300
50%     1490.000000         NaN    16.860000    17.112700    16.547300
60%     1788.000000         NaN    20.233300    20.599300    19.700000
80%     2384.000000         NaN   145.650000   150.333300   141.750000
max     2980.000000         NaN   407.733300   416.666700   405.666700

              close        volume
count   2981.000000  2.981000e+03
unique          NaN           NaN
top             NaN           NaN
freq            NaN           NaN
mean      65.366322  7.666432e+07
std       98.735729  6.443106e+07
min        1.053300  0.000000e+00
20%        2.588000  2.832945e+07
40%       14.834700  4.991352e+07
50%       16.813300  5.989550e+07
60%       20.186700  7.259400e+07
80%      145.753300  1.126440e+08
max      407.400000  5.528870e+08

In [31]:
desc2 = df.describe()

In [32]:
print(desc2)

        Unnamed: 0         open         high          low        close  \
count  2981.000000  2981.000000  2981.000000  2981.000000  2981.000000
mean   1490.000000    65.450428    67.205237    63.561403    65.366322
std     860.684902    98.925380   101.580267    95.974997    98.735729
min       0.000000     1.056700     1.108700     0.998700     1.053300
25%     745.000000    10.210000    10.600000     9.910700    10.213300
50%    1490.000000    16.860000    17.112700    16.547300    16.813300
75%    2235.000000    53.333300    54.933300    51.133300    53.319300
max    2980.000000   407.733300   416.666700   405.666700   407.400000

             volume
count  2.981000e+03
mean   7.666432e+07
std    6.443106e+07
min    0.000000e+00
25%    3.599050e+07
50%    5.989550e+07
75%    9.945450e+07
max    5.528870e+08

In [33]:
# Deleting of Colums
print(df)

      Unnamed: 0        date      open      high       low     close  \
0              0  2010-06-29    1.2667    1.6667    1.1693    1.5927
1              1  2010-06-30    1.6713    2.0280    1.5533    1.5887
2              2  2010-07-01    1.6627    1.7280    1.3513    1.4640
3              3  2010-07-02    1.4700    1.5500    1.2473    1.2800
4              4  2010-07-06    1.2867    1.3333    1.0553    1.0740
...          ...         ...       ...       ...       ...       ...
2976        2976  2023-04-10  183.5600  185.9000  176.1100  184.4000
2977        2977  2023-04-11  184.5100  189.1900  184.1500  186.6000
2978        2978  2023-04-12  186.2900  191.5900  179.7500  179.9000
2979        2979  2023-04-13  181.2500  186.5000  180.3300  185.9500
2980        2980  2023-04-14  185.3600  186.5700  182.0100  185.0000

           volume
0     277519500.0
1     253039500.0
2     121461000.0
3      75871500.0
4     101664000.0
...           ...
2976  123177931.0
2977  100721415.0
2978  131472591.0
2979   99401779.0
2980   84119837.0

[2981 rows x 7 columns]

In [34]:
deletedf = pd.read_csv("~/yfinance/nba.csv", index_col = "Name")

In [35]:
print(deletedf)

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
...                       ...     ...      ...   ...    ...     ...
Shelvin Mack        Utah Jazz     8.0       PG  26.0    6-3   203.0
Raul Neto           Utah Jazz    25.0       PG  24.0    6-1   179.0
Tibor Pleiss        Utah Jazz    21.0        C  26.0    7-3   256.0
Jeff Withey         Utah Jazz    24.0        C  26.0    7-0   231.0
NaN                       NaN     NaN      NaN   NaN    NaN     NaN

                         College     Salary
Name
Avery Bradley              Texas  7730337.0
Jae Crowder            Marquette  6796117.0
John Holland   Boston University        NaN
R.J. Hunter        Georgia State  1148640.0
Jonas Jerebko                NaN  5000000.0
...                          ...        ...
Shelvin Mack              Butler  2433333.0
Raul Neto                    NaN   900000.0
Tibor Pleiss                 NaN  2900000.0
Jeff Withey               Kansas   947276.0
NaN                          NaN        NaN

[458 rows x 8 columns]

In [36]:
deletedf.drop(["Team", "Weight"], axis = 1, inplace = True)

In [37]:
deletedf

               Number Position   Age Height            College     Salary
Name
Avery Bradley     0.0       PG  25.0    6-2              Texas  7730337.0
Jae Crowder      99.0       SF  25.0    6-6          Marquette  6796117.0
John Holland     30.0       SG  27.0    6-5  Boston University        NaN
R.J. Hunter      28.0       SG  22.0    6-5      Georgia State  1148640.0
Jonas Jerebko     8.0       PF  29.0   6-10                NaN  5000000.0
...               ...      ...   ...    ...                ...        ...
Shelvin Mack      8.0       PG  26.0    6-3             Butler  2433333.0
Raul Neto        25.0       PG  24.0    6-1                NaN   900000.0
Tibor Pleiss     21.0        C  26.0    7-3                NaN  2900000.0
Jeff Withey      24.0        C  26.0    7-0             Kansas   947276.0
NaN               NaN      NaN   NaN    NaN                NaN        NaN

[458 rows x 6 columns]

In [38]:
first = deletedf.loc["Avery Bradley"]
second = deletedf.loc["R.J. Hunter"]
third = deletedf.loc["John Holland"]

In [39]:
print(first, "\n\n\n\n", second, "\n\n\n\n", third)

Number            0.0
Position           PG
Age              25.0
Height            6-2
College         Texas
Salary      7730337.0
Name: Avery Bradley, dtype: object



 Number               28.0
Position               SG
Age                  22.0
Height                6-5
College     Georgia State
Salary          1148640.0
Name: R.J. Hunter, dtype: object



 Number                   30.0
Position                   SG
Age                      27.0
Height                    6-5
College     Boston University
Salary                    NaN
Name: John Holland, dtype: object

In [40]:
deletedf.head(10)

               Number Position   Age Height            College      Salary
Name
Avery Bradley     0.0       PG  25.0    6-2              Texas   7730337.0
Jae Crowder      99.0       SF  25.0    6-6          Marquette   6796117.0
John Holland     30.0       SG  27.0    6-5  Boston University         NaN
R.J. Hunter      28.0       SG  22.0    6-5      Georgia State   1148640.0
Jonas Jerebko     8.0       PF  29.0   6-10                NaN   5000000.0
Amir Johnson     90.0       PF  29.0    6-9                NaN  12000000.0
Jordan Mickey    55.0       PF  21.0    6-8                LSU   1170960.0
Kelly Olynyk     41.0        C  25.0    7-0            Gonzaga   2165160.0
Terry Rozier     12.0       PG  22.0    6-2         Louisville   1824360.0
Marcus Smart     36.0       PG  22.0    6-4     Oklahoma State   3431040.0

In [41]:
print(deletedf)

               Number Position   Age Height            College     Salary
Name
Avery Bradley     0.0       PG  25.0    6-2              Texas  7730337.0
Jae Crowder      99.0       SF  25.0    6-6          Marquette  6796117.0
John Holland     30.0       SG  27.0    6-5  Boston University        NaN
R.J. Hunter      28.0       SG  22.0    6-5      Georgia State  1148640.0
Jonas Jerebko     8.0       PF  29.0   6-10                NaN  5000000.0
...               ...      ...   ...    ...                ...        ...
Shelvin Mack      8.0       PG  26.0    6-3             Butler  2433333.0
Raul Neto        25.0       PG  24.0    6-1                NaN   900000.0
Tibor Pleiss     21.0        C  26.0    7-3                NaN  2900000.0
Jeff Withey      24.0        C  26.0    7-0             Kansas   947276.0
NaN               NaN      NaN   NaN    NaN                NaN        NaN

[458 rows x 6 columns]

In [42]:
deletedf.head(5)

               Number Position   Age Height            College     Salary
Name
Avery Bradley     0.0       PG  25.0    6-2              Texas  7730337.0
Jae Crowder      99.0       SF  25.0    6-6          Marquette  6796117.0
John Holland     30.0       SG  27.0    6-5  Boston University        NaN
R.J. Hunter      28.0       SG  22.0    6-5      Georgia State  1148640.0
Jonas Jerebko     8.0       PF  29.0   6-10                NaN  5000000.0

In [43]:
new_row = pd.DataFrame({'Name':'Geeks', 'Team':'Boston', 'Number':3,
                        'Position':'PG', 'Age':33, 'Height':'6-2',
                        'Weight':189, 'College':'MIT', 'Salary':99999},
                                                            index =[0])

In [52]:
# Simply concatenate both dataframes
deletedf = pd.concat([new_row, deletedf]).reset_index(drop = True)

In [53]:
deletedf.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,index
0,Geeks,Boston,3.0,PG,33.0,6-2,189.0,MIT,99999.0,NaN
1,Geeks,Boston,3.0,PG,33.0,6-2,189.0,MIT,99999.0,0.0
2,Geeks,Boston,3.0,PG,33.0,6-2,189.0,MIT,99999.0,0.0
3,NaN,NaN,0.0,PG,25.0,6-2,NaN,Texas,7730337.0,1.0
4,NaN,NaN,99.0,SF,25.0,6-6,NaN,Marquette,6796117.0,2.0

In [54]:
deleterow =  pd.read_csv("~/yfinance/nba.csv", index_col = "Name")

In [55]:
print(deleterow)

                         Team  Number Position   Age Height  Weight  \
Name
Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
Jae Crowder    Boston Celtics    99.0       SF  25.0    6-6   235.0
John Holland   Boston Celtics    30.0       SG  27.0    6-5   205.0
R.J. Hunter    Boston Celtics    28.0       SG  22.0    6-5   185.0
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
...                       ...     ...      ...   ...    ...     ...
Shelvin Mack        Utah Jazz     8.0       PG  26.0    6-3   203.0
Raul Neto           Utah Jazz    25.0       PG  24.0    6-1   179.0
Tibor Pleiss        Utah Jazz    21.0        C  26.0    7-3   256.0
Jeff Withey         Utah Jazz    24.0        C  26.0    7-0   231.0
NaN                       NaN     NaN      NaN   NaN    NaN     NaN

                         College     Salary
Name
Avery Bradley              Texas  7730337.0
Jae Crowder            Marquette  6796117.0
John Holland   Boston University        NaN
R.J. Hunter        Georgia State  1148640.0
Jonas Jerebko                NaN  5000000.0
...                          ...        ...
Shelvin Mack              Butler  2433333.0
Raul Neto                    NaN   900000.0
Tibor Pleiss                 NaN  2900000.0
Jeff Withey               Kansas   947276.0
NaN                          NaN        NaN

[458 rows x 8 columns]

In [48]:
deleterow.drop(["Avery Bradley", "Jae Crowder"], inplace = True)

In [49]:
deleterow

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [71]:
row_slice = deleterow.iloc[3:10, :]

In [72]:
row_slice

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0

In [73]:
display(row_slice.head(5))

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0

In [74]:
row_names = row_slice['Salary']

In [75]:
row_names

Name
R.J. Hunter       1148640.0
Jonas Jerebko     5000000.0
Amir Johnson     12000000.0
Jordan Mickey     1170960.0
Kelly Olynyk      2165160.0
Terry Rozier      1824360.0
Marcus Smart      3431040.0
Name: Salary, dtype: float64

In [77]:
display(deleterow.head(5))

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [78]:
first = deleterow['College']

In [82]:
display(first.head(10))

Name
Avery Bradley                Texas
Jae Crowder              Marquette
John Holland     Boston University
R.J. Hunter          Georgia State
Jonas Jerebko                  NaN
Amir Johnson                   NaN
Jordan Mickey                  LSU
Kelly Olynyk               Gonzaga
Terry Rozier            Louisville
Marcus Smart        Oklahoma State
Name: College, dtype: object

In [80]:
display(first.tail(n = 10))

Name
Gordon Hayward      Butler
Rodney Hood           Duke
Joe Ingles             NaN
Chris Johnson       Dayton
Trey Lyles        Kentucky
Shelvin Mack        Butler
Raul Neto              NaN
Tibor Pleiss           NaN
Jeff Withey         Kansas
NaN                    NaN
Name: College, dtype: object

In [83]:
print(first)

Name
Avery Bradley                Texas
Jae Crowder              Marquette
John Holland     Boston University
R.J. Hunter          Georgia State
Jonas Jerebko                  NaN
                       ...
Shelvin Mack                Butler
Raul Neto                      NaN
Tibor Pleiss                   NaN
Jeff Withey                 Kansas
NaN                            NaN
Name: College, Length: 458, dtype: object

In [84]:
deleterow

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...
Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [85]:
columnnames = deleterow[['Age', 'College', 'Salary']]

In [86]:
print('\n Multiple Columns selected from Dataset')
print(columnnames)
print(columnnames.head(5))
print(columnnames.tail(5))

 Multiple Columns selected from Dataset
                Age            College     Salary
Name
Avery Bradley  25.0              Texas  7730337.0
Jae Crowder    25.0          Marquette  6796117.0
John Holland   27.0  Boston University        NaN
R.J. Hunter    22.0      Georgia State  1148640.0
Jonas Jerebko  29.0                NaN  5000000.0
...             ...                ...        ...
Shelvin Mack   26.0             Butler  2433333.0
Raul Neto      24.0                NaN   900000.0
Tibor Pleiss   26.0                NaN  2900000.0
Jeff Withey    26.0             Kansas   947276.0
NaN             NaN                NaN        NaN

[458 rows x 3 columns]
                Age            College     Salary
Name
Avery Bradley  25.0              Texas  7730337.0
Jae Crowder    25.0          Marquette  6796117.0
John Holland   27.0  Boston University        NaN
R.J. Hunter    22.0      Georgia State  1148640.0
Jonas Jerebko  29.0                NaN  5000000.0
               Age College     Salary
Name
Shelvin Mack  26.0  Butler  2433333.0
Raul Neto     24.0     NaN   900000.0
Tibor Pleiss  26.0     NaN  2900000.0
Jeff Withey   26.0  Kansas   947276.0
NaN            NaN     NaN        NaN

In [87]:
singlerow = deleterow.loc["Jeff Withey"]

In [88]:
singlerow

Team        Utah Jazz
Number           24.0
Position            C
Age              26.0
Height            7-0
Weight          231.0
College        Kansas
Salary       947276.0
Name: Jeff Withey, dtype: object

In [92]:
multiplerow = deleterow.loc[['Jeff Withey', 'Jonas Jerebko', 'Raul Neto']]

In [94]:
display(multiplerow)
print(multiplerow)

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0

                         Team  Number Position   Age Height  Weight College  \
Name
Jeff Withey         Utah Jazz    24.0        C  26.0    7-0   231.0  Kansas
Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0     NaN
Raul Neto           Utah Jazz    25.0       PG  24.0    6-1   179.0     NaN

                  Salary
Name
Jeff Withey     947276.0
Jonas Jerebko  5000000.0
Raul Neto       900000.0

In [98]:
multiplerow_column = deleterow.loc[['Jeff Withey', 'Jonas Jerebko', 'Raul Neto'], ['Team', 'Number', 'Position', 'Salary']]

In [99]:
display(multiplerow_column)

                         Team  Number Position     Salary
Name
Jeff Withey         Utah Jazz    24.0        C   947276.0
Jonas Jerebko  Boston Celtics     8.0       PF  5000000.0
Raul Neto           Utah Jazz    25.0       PG   900000.0

In [101]:
all_rows_specific_columns = deleterow.loc[:, ['Team', 'Number', 'Position', 'Salary']]

In [105]:
display(all_rows_specific_columns)
print(all_rows_specific_columns)

                         Team  Number Position     Salary
Name
Avery Bradley  Boston Celtics     0.0       PG  7730337.0
Jae Crowder    Boston Celtics    99.0       SF  6796117.0
John Holland   Boston Celtics    30.0       SG        NaN
R.J. Hunter    Boston Celtics    28.0       SG  1148640.0
Jonas Jerebko  Boston Celtics     8.0       PF  5000000.0
...                       ...     ...      ...        ...
Shelvin Mack        Utah Jazz     8.0       PG  2433333.0
Raul Neto           Utah Jazz    25.0       PG   900000.0
Tibor Pleiss        Utah Jazz    21.0        C  2900000.0
Jeff Withey         Utah Jazz    24.0        C   947276.0
NaN                       NaN     NaN      NaN        NaN

[458 rows x 4 columns]

                         Team  Number Position     Salary
Name
Avery Bradley  Boston Celtics     0.0       PG  7730337.0
Jae Crowder    Boston Celtics    99.0       SF  6796117.0
John Holland   Boston Celtics    30.0       SG        NaN
R.J. Hunter    Boston Celtics    28.0       SG  1148640.0
Jonas Jerebko  Boston Celtics     8.0       PF  5000000.0
...                       ...     ...      ...        ...
Shelvin Mack        Utah Jazz     8.0       PG  2433333.0
Raul Neto           Utah Jazz    25.0       PG   900000.0
Tibor Pleiss        Utah Jazz    21.0        C  2900000.0
Jeff Withey         Utah Jazz    24.0        C   947276.0
NaN                       NaN     NaN      NaN        NaN

[458 rows x 4 columns]

In [108]:
ilocselections = deleterow.iloc[[2,3,4], [1,2,3,4,5]]

In [111]:
ilocselections
display(ilocselections)

               Number Position   Age Height  Weight
Name
John Holland     30.0       SG  27.0    6-5   205.0
R.J. Hunter      28.0       SG  22.0    6-5   185.0
Jonas Jerebko     8.0       PF  29.0   6-10   231.0

In [113]:
value = deleterow.at['John Holland', 'Age']
display(value)

27.0

In [114]:
result = deleterow.query("Age > 25 and College == 'Duke'")
result

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Lance Thomas,New York Knicks,42.0,SF,28.0,6-8,235.0,Duke,1636842.0
Elton Brand,Philadelphia 76ers,42.0,PF,37.0,6-9,254.0,Duke,NaN
JJ Redick,Los Angeles Clippers,4.0,SG,31.0,6-4,190.0,Duke,7085000.0
Mike Dunleavy,Chicago Bulls,34.0,SG,35.0,6-9,230.0,Duke,4500000.0
Dahntay Jones,Cleveland Cavaliers,30.0,SG,35.0,6-6,225.0,Duke,NaN
Miles Plumlee,Milwaukee Bucks,18.0,C,27.0,6-11,249.0,Duke,2109294.0
Luol Deng,Miami Heat,9.0,SF,31.0,6-9,220.0,Duke,10151612.0
Josh McRoberts,Miami Heat,4.0,PF,29.0,6-10,240.0,Duke,5543725.0
Kyle Singler,Oklahoma City Thunder,5.0,SF,28.0,6-8,228.0,Duke,4500000.0
Gerald Henderson,Portland Trail Blazers,9.0,SG,28.0,6-5,215.0,Duke,6000000.0
Mason Plumlee,Portland Trail Blazers,24.0,C,26.0,6-11,235.0,Duke,1415520.0